benchmarks/ringo-node/buffer-alloc/node.out
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        
Server Hostname:        0.0.0.0
Server Port:            8001

Document Path:          //
Document Length:        1024 bytes

Concurrency Level:      50
Time taken for tests:   15.645 seconds
Complete requests:      50000
Failed requests:        0
Write errors:           0
Total transferred:      54400000 bytes
HTML transferred:       51200000 bytes
Requests per second:    3195.91 [#/sec] (mean)
Time per request:       15.645 [ms] (mean)
Time per request:       0.313 [ms] (mean, across all concurrent requests)
Transfer rate:          3395.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0      13
Processing:     0   16   9.1     15      48
Waiting:        0   15   9.1     15      47
Total:          1   16   9.1     15      48

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     19
  75%     22
  80%     24
  90%     28
  95%     31
  98%     36
  99%     39
 100%     48 (longest request)