benchmarks/ringo-node/buffer-alloc/ringo.out
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        Jetty(7.1.6.v20100715)
Server Hostname:        0.0.0.0
Server Port:            8001

Document Path:          //
Document Length:        1024 bytes

Concurrency Level:      50
Time taken for tests:   13.050 seconds
Complete requests:      50000
Failed requests:        0
Write errors:           0
Total transferred:      58051040 bytes
HTML transferred:       51245056 bytes
Requests per second:    3831.34 [#/sec] (mean)
Time per request:       13.050 [ms] (mean)
Time per request:       0.261 [ms] (mean, across all concurrent requests)
Transfer rate:          4344.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   1.3      6      16
Processing:     2    7   1.7      7      33
Waiting:        0    5   1.9      5      30
Total:          6   13   1.4     13      38

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     13
  75%     13
  80%     13
  90%     14
  95%     15
  98%     17
  99%     19
 100%     38 (longest request)